[
    [
      {
        "Header": "Leadership",
        "Title": "MSOE Cater Program Assistant | Carter Program | Milwaukee, WI | July - August 2019",
        "Details": [
          "Organized events to foster relationships and build community, e.g., poem contest, Lightspeed field trip.",
          "Mentored future MSOE students, teaching skills to increase successful first year at MSOE.",
          "Tutored Students in Math, Physics, and Chemistry."
        ]
      }
    ],

    [
      {
        "Header": "Internship",
        "Title": "Innovation Platform Developer | Rockwell Automation | Milwaukee, WI | Jun - Aug 2020",
        "Details": [
        "Improved test coverage by 80% for more than 10 files, reducing the number of bugs and security risks.",
          "Developed 4 new customer-desired features that included some REST API functionality.",
          "Integrated Aha! API to allow users to submit ideas from innovation website to Aha!.",
          "Created feature that allowed users to write success stories detailing their experience using the site.",
          "Implemented feature to send emails to user for invitation to join a specific team, utilizing REST API to change states efficiently.",
          "Converted website from http to https to allow integration with outside APIs that required SSL/TSL certificate.",
          "Participated in VOC (Voice of Customer) meetings to gain Innovate Website user feedback to identify modifications to optimize usability."
        ]
      }
    ],


    [
      {

        "Header": "Work Experience",
        "Title": "Amazon Picker/Stower | Amazon Warehouse | Charlotte, NC | Summers 2017 - 2019",
        "Details": [
          "Troubleshooting and problem-solving techniques in a high stress, competitive environment and produced adaptable, real-time strategy updates.",
          "Collaborated with team to meet and achieve goals for performance and production.",
          "Worked efficiently in a fast-paced environment with high expectations."
        ]
      },

      {
        "Header": "Work Experience",
        "Title": "Camp Coach | Dream Big Basketball | Charlotte, NC | Seasonally 2016 - 2017",
        "Details": [
          "Developed youth (1st – 7th grade) basketball skills while also teaching the importance of teamwork, sportsmanship, hard work, and humility."
        ]
      }

    ]
]