[
  {
    "title": "Image Manipulator (Individual Project)",
    "description": "Developed Image Manipulator program, including file extensions, capable of reading and writing multiple image formats as well as changing colors and tones. Developed Image Manipulator program, including file extensions, capable of reading and writing multiple image formats as well as changing colors and tones.",
    "details": [
      "Developed, tested, and debugged code using Java Object Oriented and Functional Programming methods.",
      "Designed a non-trivial interactive two window Graphical User Interface for maximum accessibility.",
      "Brainstormed code outline using UML diagram and wrote robust code with error handling."
    ]
  },
  {
    "title": "Word Counter (Group Project)",
    "description": "Developed Word Counter capable of detecting various options in a document: invalid words and location, number of times letters appeared, how many valid words on each line, etc.",
    "details": [
      "Used TreeMap in order to store alphabets and their frequency, resulted in better Asymptotic time complexity.",
      "Created repository using Bitbucket and used Git for project version control.",
      "Created uml diagrams using Enterprise Architect and used code engineering to convert code to Java.",
      "Wrote unit test to minimize possibility of errors.",
      "Modified code to make it more efficient, i.e using TreeMap instead of array list to store alphabet values"
    ]
  },
  {
    "title": "GPS Tracker (Group Project)",
    "description": "Developed GPS tracker capable of reading xml files to determine various analytics that users would want to know: distance between two locations, average speed between track of coordinates, etc.",
    "details": [
      "Analyzed functional requirements (written as user stories) and developed use cases that described how application would work.",
      "Developed user interface mockups using Enterprise Architect.",
      "Created high level sequence diagrams illustrating interactions between elements of use cases.",
      "Used method of textual analysis to identify potential classes or objects and method by examining nouns and verbs used in use case scenarios."
    ]
  }
]